
import threading
import time
import telebot
from telebot import types
import random
from flask import Flask
from threading import Thread

app = Flask('')

@app.route('/')
def home():
    return "OK"

def run():
    app.run(host='0.0.0.0', port=8080)

def keep_alive():
    t = Thread(target=run)
    t.start()

# Запускаем веб-сервер
keep_alive()

bot = telebot.TeleBot('8312989642:AAHnXUK1JBJamX_YtcyzZIVci5sk4tTmHIs')

# --- ДАННЫЕ ---
themes = {
    "🌍 Локации": [
    "Школа", "Детский сад", "Университет", "Больница", "Поликлиника", "Аптека", 
    "Магазин", "Супермаркет", "Рынок", "Торговый центр", "Банк", "Почта",
    "Парк", "Зоопарк", "Цирк", "Детская площадка", "Стадион", "Бассейн",
    "Кинотеатр", "Театр", "Музей", "Библиотека", "Выставка", "Концерт",
    "Ресторан", "Кафе", "Столовая", "Пиццерия", "Макдоналдс", "Кофейня",
    "Пляж", "База отдыха", "Лес", "Горы", "Река", "Озеро", "Деревня", "Дача",
    "Аэропорт", "Вокзал", "Метро", "Остановка", "Заправка", "Автомойка",
    "Отель", "Хостел", "Подъезд", "Лифт", "Квартира", "Кухня", "Ванная",
    "Тренажерный зал", "Фитнес-клуб", "Салон красоты", "Парикмахерская",
    "Полиция", "Пожарная часть", "Суд", "Тюрьма", "Военная база", "Стройка",
    "Офис", "Склад", "Завод", "Мастерская", "Гараж", "Чердак", "Подвал",
    "Корабль", "Лодка", "Подводная лодка", "Самолет", "Вертолет", "Поезд", 
    "Автобус", "Такси", "Трамвай", "Троллейбус", "Грузовик", "Космос",
    "Станция МКС", "Луна", "Марс", "Пустыня", "Джунгли", "Пещера",
    "Церковь", "Замок", "Дворец", "Музей искусств", "Планетарий", "Аквапарк",
    "Каток", "Боулинг", "Бильярд", "Ночной клуб", "Караоке", "Тир", "Рыбалка",
    "Охота", "Огород", "Теплица", "Пасека", "Ферма", "Конюшня",
],
    "🏰 Clash Royale": [
    "Рыцарь", "Лучницы", "Гигант", "Бомбер", "Принцесса(Башня)", "Скелеты", "Гоблины", 
    "Всадник на кабане", "Мушкетер", "Мини П.Е.К.К.А.", "Валькирия", "Принц", "Мини-генераторы",
    "Дракончик", "Армия скелетов", "Ведьма", "Воздушный шар", "Три мушкетерки", "Летучка",
    "Варвары", "Орда миньонов", "Гоблины-копейщики", "Гигантский скелет", "П.Е.К.К.А.", 
    "Миньоны", "Королевский гигант", "Огненный дух", "Ледяной дух", "Элитные варвары", 
    "Мегаминьон", "Ледяной колдун", "Шахтер", "Принцесса", "Адская Гончая", "Спарки", 
    "Дровосек", "Громовержец", "Бандитка", "Ночная ведьма", "Магический лучник", "Летучие мыши",
    "Королевский призрак", "Всадник на баране (PЭМ)", "Палач", "Крестьянин", "Охотник",  
    "Электрический дракон", "Стенобои", "Целительница-воин", "Королевские кабаны", "Лоза",
    "Мегарыцарь", "Рыбак", "Электрический гигант", "Ведьмина бабушка", "Золотой рыцарь", "Стражи",
    "Король скелетов", "Королева лучниц", "Шустрый шахтёр", "Монах", "Императрица духов", 
    "Маленький принц", "Электрический дух", "Дух исцеления", "Феникс", "Темный принц", "Пушка на колёсах",
    "Стрелы", "Огненный шар", "Ракета", "Молния", "Разряд", "Зеркало", "Ярость", "Руническая гигантша",
    "Заморозка", "Яд", "Бревно", "Торнадо", "Клон", "Землетрясение", "Снежок", "Берсеркша",
    "Королевская почта", "Гоблинская бочка", "Бочка со скелетами", "Варварская бочка", "Гигантский гоблин",
    "Гоблинское проклятие", "Бездна", "Канонир (башня)", "Графиня (башня)", "Повар (башня)",
    "Пушка", "Тесла", "Мортира", "Башня-бомбежка", "Адская башня", "Арбалет", "Огненная лучница", 
    "Сборщик эликсира", "Надгробие", "Хижина гоблинов", "Хижина варваров", "Печь", "Костяные драконы",
    "Клетка с гоблином", "Гоблинский бур", "Ледяной голем", "Голем", "Банда гоблинов", "Рекруты",
    "Разбойники", "Элексирный голем", "Гоблин с дротиками", "Подозрительный куст","Таран", "Колдун",
    "Пламенный дракон", "Кладбище", "Гоблинская машина", "Главная бандитка", "Гоблинштейн", "Гоблин-подрывник",
],
    "🎮 Видеоигры": [
    "Minecraft", "Counter-strike 2 (CS 2)", "Dota 2", "GTA 5", "Sims", "Roblox", "Fortnite", "PUBG", "Terraria",
    "Valorant", "Portal 2", "Call of Duty", "Team fortress 2", "Rust", "Genshin Impact", "Cyberpank 2077", "War Thunder",
    "World of Tanks", "Hello Neighbord", "Subway Surfers", "Free Fire", "Clash of clans", "Need for Speed", "Among as",
    "Clash Royal", "Temple Run", "Fruit Ninja", "Angry Birds", "Brawl Stars", "Homescapes", "Hill climb racing", 
    "Tom", "Geometry dash", "Flappy bird", "Hay Day", "Shadow fight", "Sonic", "stumble guys", "Tetris", "Chess",
    "Checkers", "Block blast", "Granny", 
],
    
    "⛏ Minecraft": [
        # --- Строительные блоки и природа ---
        "Бедрок", "Булыжник", "Глубинный сланец", "Туф", "Кальцит", "Диорит", "Андезит", "Гранит",
        "Земля", "Подзол", "Мицелий", "Дерн", "Грязь", "Плотная грязь", "Глина", "Терракота",
        "Песок", "Красный песок", "Гравий", "Обсидиан", "Плачущий обсидиан", "Магма",
        "Лед", "Плотный лед", "Синий лед", "Снег", "Слой снега", "Плотный снег",
    
        # --- Дерево (все виды) ---
        "Дубовое бревно", "Березовое бревно", "Еловое бревно", "Тропическое бревно", 
        "Акациевое бревно", "Темное дубовое бревно", "Мангровое бревно", "Вишневое бревно", 
        "Обтесанное бревно", "Доски", "Ступеньки", "Плита", "Забор", "Калитка", "Дверь", "Люк",
    
        # --- Руды и ценности ---
        "Угольная руда", "Железная руда", "Медная руда", "Золотая руда", "Редстоуновая руда",
        "Лазуритовая руда", "Алмазная руда", "Изумрудная руда", "Позолоченный чернит",
        "Древние обломки", "Незеритовый скрап", "Незеритовый слиток", "Медный слиток",
        "Аметистовый кластер", "Осколок аметиста", "Эхо-осколок", "Осколок призмарина",
    
        # --- Незер и Эндер мир ---
        "Незерак", "Камень Энда", "Песок душ", "Почва душ", "Базальт", "Чернит",
        "Искаженный грибок", "Багровый грибок", "Светокамень", "Стержень Энда",
        "Пурпурный блок", "Яйцо дракона", "Скорлупа шалкера", "Шалкеровый ящик",
    
        # --- Механизмы и Редстоун ---
        "Поршень", "Липкий поршень", "Наблюдатель", "Раздатчик", "Выбрасыватель",
        "Повторитель", "Компаратор", "Рычаг", "Кнопка", "Нажимная плита", "Мишень",
        "Музыкальный блок", "Проигрыватель", "Лампа", "Датчик дневного света",
        "Громоотвод", "Автоматический верстак", "Калиброванный скалковый сенсор",
    
        # --- Инструменты, Оружие и Броня ---
        "Подзорная труба", "Щит", "Трезубец", "Арбалет", "Лук", "Огнево", "Поводок",
        "Бирка", "Седло", "Конская броня", "Незеритовый шлем", "Незеритовый нагрудник",
        "Незеритовые поножи", "Незеритовые ботинки", "Элитра", "Тотем бессмертия",
    
        # --- Еда и Зельеварение ---
        "Золотая морковь", "Зачарованное золотое яблоко", "Тушеное кроличье мясо",
        "Ломтик арбуза", "Ягода светящаяся", "Хорус", "Пузырек опыта", "Глаз Эндера",
        "Слеза Гаста", "Сгусток магмы", "Дыхание дракона", "Зелье невидимости"
    ] 
}
game_data = {
    "selected_theme": list(themes.keys())[0],
    "players": {}  # ID: Имя
}

# --- ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ ---

def delete_msg(chat_id, message_id, delay):
    time.sleep(delay)
    try:
        bot.delete_message(chat_id, message_id)
    except:
        pass

def send_role_msg(p_id, text, chat_id):
    """Отправляет роль в личку и запускает таймер удаления"""
    try:
        #msg = bot.send_message(p_id, f"{text}\n\nТема: {game_data['selected_theme']}\n⌛ Исчезнет через 60 сек.")
        msg = bot.send_message(p_id, f"{text}\n\n⌛ Исчезнет через 30 сек.")
        threading.Thread(target=delete_msg, args=(p_id, msg.message_id, 30)).start()
    except:
        bot.send_message(chat_id, f"⚠️ Игрок {game_data['players'].get(p_id, p_id)} не запустил бота в ЛС!")

def main_menu_markup():
    markup = types.InlineKeyboardMarkup()
    
    # Кнопки ссылок (Слова и Админ)
    btn_words = types.InlineKeyboardButton("📖 Список слов", url="https://telegra.ph/Spisok-slov-01-26") # Сюда ссылку
    btn_admin = types.InlineKeyboardButton("👨‍💻 Админ", url="https://t.me/Step20110") # Сюда логин
    
    # Кнопки управления игрой
    btn_theme = types.InlineKeyboardButton(f"📁 Тема: {game_data['selected_theme']}", callback_data="change_theme")
    btn_join = types.InlineKeyboardButton(f"🙋 Участвовать ({len(game_data['players'])})", callback_data="join_game")
    btn_start = types.InlineKeyboardButton("🚀 НАЧАТЬ ИГРУ", callback_data="run_game")
    btn_reset = types.InlineKeyboardButton("🔄 Сброс", callback_data="reset_all")
    
    # Расставляем кнопки красиво
    markup.row(btn_words, btn_admin)
    markup.row(btn_theme)
    markup.row(btn_join)
    markup.row(btn_start)
    markup.row(btn_reset)
    return markup

# --- ОБРАБОТЧИКИ ---

@bot.message_handler(commands=['start'])
def start(message):
    bot.send_message(
        message.chat.id, 
        '🎮 Вас встречает игра: "Шпион"\n\nСнизу весь функционал.\n\nОсновное правило: ДОЛБОЁБЫ НЕ ГОЛОСУЙТЕ ПРОТИВ ЯРИКА!',
        parse_mode="Markdown",
        reply_markup=main_menu_markup()
    )

@bot.callback_query_handler(func=lambda call: True)
def callback_query(call):
    chat_id = call.message.chat.id
    user_id = call.from_user.id
    user_name = call.from_user.first_name

    if call.data == "join_game":
        if user_id not in game_data["players"]:
            game_data["players"][user_id] = user_name
            bot.answer_callback_query(call.id, "Ты в игре!")
        else:
            bot.answer_callback_query(call.id, "Ты уже в списке")
        bot.edit_message_reply_markup(chat_id, call.message.message_id, reply_markup=main_menu_markup())

    elif call.data == "change_theme":
        markup = types.InlineKeyboardMarkup()
        for t in themes.keys():
            markup.add(types.InlineKeyboardButton(t, callback_data=f"set_{t}"))
        bot.edit_message_text("Выбери тему:", chat_id, call.message.message_id, reply_markup=markup)

    elif call.data.startswith("set_"):
        game_data["selected_theme"] = call.data.replace("set_", "")
        bot.edit_message_text(f"✅ Тема выбрана!", chat_id, call.message.message_id, reply_markup=main_menu_markup())

    elif call.data == "reset_all":
        game_data["players"] = {}
        bot.edit_message_text("🔄 Список очищен!", chat_id, call.message.message_id, reply_markup=main_menu_markup())

    elif call.data == "run_game":
        if len(game_data["players"]) < 3:
            bot.answer_callback_query(call.id, "Нужно минимум 3 игрока!", show_alert=True)
            return

        player_ids = list(game_data["players"].keys())
        theme_words = themes[game_data["selected_theme"]]
        mode_roll = random.randint(1, 100) # Шанс режима
        

        # РЕЖИМЫ ИГРЫ
        if mode_roll <= 30:  # 30% шанс: Шпиона нет
            location = random.choice(theme_words)
            for p_id in player_ids:
                send_role_msg(p_id, f"📍 Выпало слово: {location}\nТема: {game_data['selected_theme']}\nЖелаю Найти Шпиона!", chat_id)
            

        elif mode_roll <= 45: # 15% шанс: Все шпионы
            for p_id in player_ids:
                send_role_msg(p_id, f"Роль: 🕵️ ШПИОН!\nТема: {game_data['selected_theme']}\n Желаю удачи!", chat_id)

        elif mode_roll <= 60: # 15% шанс: Полный хаос (разные локации)
            for p_id in player_ids:
                rand_loc = random.choice(theme_words)
                send_role_msg(p_id, f"Роль: 🕊 Мирный\n📍 Выпало слово: {rand_loc}\nТема: {game_data['selected_theme']}\n Удачи найти Шпиона!", chat_id)

        else: # 40% шанс: Обычная игра
            location = random.choice(theme_words)
            spy_id = random.choice(player_ids)
            for p_id in player_ids:
                if p_id == spy_id:
                    send_role_msg(p_id, f"Роль: 🕵️ ШПИОН!\nТема: {game_data['selected_theme']}\nЖелаю удачи!", chat_id)
                else:
                    send_role_msg(p_id, f"Роль: 🕊 Мирный\n📍 Выпало слово: {location}\nТема: {game_data['selected_theme']}\n Удачи найти Шпиона!", chat_id)


print("Бот запущен и готов служить(P.S. Генерал гавс!)")
bot.polling(none_stop=True)


